[{"Review":"No compromise in quality at Mahindra Ltd. Completely focused on safety first.. Managers and colleuge are very supportive. Got the opportunity to learn what is ISO & CERTIFICATIONS.","Sentiment":[Positive]},{"Review":"I have had a wonderful 3 year plus journey with JLL. The management is very open to innovation and new ideas. The work culture is super flexible and accommodating.","Sentiment":[Positive]},{"Review":"management improvement needed. lack of appreciation  from top level management.no time management. negligence towards new staff training. bonus not given on time.","Sentiment":[Negative]},{"Review":"Good work culture\r \r Good environment \r \r No work pressure \r \r Work environment is very nice, start career in best industry in Hp \r Good salary for the region\r Employee fiiendly region\r Flexible work life balance\r Benfits are good","Sentiment":[Positive]},{"Review":"Very hard to work in this bank, very lengthy process and very slow system. Management not supportive, backed process is very slow and not supportive.Very bad workplace culture. Not any enjoyable part of the job.","Sentiment":[Negative]},{"Review":"They have good problem solving approaches by sitting in a board room and having a group discussion. The team is highly skilled and quick on their feet.","Sentiment":[Positive]},{"Review":"while working with yes bank was good ,\r Work culture is nice . \r We get good support from the top management in regards to job profile , your score card in regards to service and sales parameters.\r HR support is very good in yes bank i.e post hiring doc, hr seasons for grooming  of job profile.\r \r \r \r \r \r Reason for leaving is relocation as yes bank is having limited options in my home town .","Sentiment":[Neutral]},{"Review":"JOB RESPONSIBLITIES :-\r                  24hr men power controlling.\r                  Operating overall diesel generator.\r                   Maintenance and service diesel engines sets. \r                   Overall automatic control panel repair DG sets.  \r                  DG sets, alternators repair and maintenance.\r                  Monthly report smites in department.","Sentiment":[Neutral]},{"Review":"Our day started with stand up meeting with our scrum team. Nokia follows Agile way of working. We update what we did yesterday and what work we are going to do today to the scrum team.\r \r We pick up the task from Kanban board and start working.\r \r Lot of importance to team work is given in Nokia.","Sentiment":[Neutral]},{"Review":"Was working Larsen & Toubro As Product Development Engineer.\r \r Was working on new products as per customer requirements for customers like steel industries, thermal power plants, cement industries","Sentiment":[Neutral]},{"Review":"Good Place to work.\r Growth Curve is excellent..\r \r Work with the new techs and with the software engineers..\r technology, work with best in industry,","Sentiment":[Positive]},{"Review":"My project was good and required lots if skills.Campus as in infrastructure is very good for all places.Services and Facilities which i got from infosys is too good.","Sentiment":[Positive]},{"Review":"Good company with good ethics and working culture\r \r Work life balance is good\r \r Good pay hikes\r Unlike other companies they have internal job posting portal","Sentiment":[Positive]},{"Review":"Nice place to work and people's company. One of the largest firm and largest bank over the globe.\r \r Very highly recommended and reputed company in banking sector.","Sentiment":[Positive]},{"Review":"Struggle at the start of the career. Less growth and opportunities. Once you acquire higher positions payments and recognition are good. Accenture provides good work-life balance.","Sentiment":[Neutral]},{"Review":"It is a good place to work if you like Hyderabad as a city. There is a great deal of learning if you get good team. Overall company, especially salary is really good to startup your career with. But a word of caution, it is difficult to adapt in the outside market after you work here.","Sentiment":[Neutral]},{"Review":"Its a nice job for achieving targets and learn many more through my seniors and bank staff. My overall experience in hdfc bank is learning and geartfull job for me but as a sallary its not better for me.","Sentiment":[Neutral]},{"Review":"Good place to work. Highly engaged with work and management supports for additional activities. Not getting bored of doing same work. Have professionalism in the work place.","Sentiment":[Positive]},{"Review":"Awesome WorkExpereince and Good Work Environment.\r Great Learning Opportunity.\r Good Training Facility.\r Awesome WorkExpereince and Good Work Environment.","Sentiment":[Positive]},{"Review":"Bosch is a company which mainly depends and works on systematic processes due to which the decision making is pretty. Except that everything else is to the positive of the company. There is an amazing work life balance and the best co-operation from the fellow collegues. The bosses are a bit bossy due to which there are some uneasiness in the work environment","Sentiment":[Neutral]},{"Review":"Well received Hr's and good place to work and work environment is good and supporting teams are help in hand. Good support of transport, tie security and good food.","Sentiment":[Positive]},{"Review":"Opportunities are always there to showcase one's own capability. Rewards and recognition helped to boost the morale. The company provides great support for work life balance.","Sentiment":[Positive]},{"Review":"Typical work is as follows.\r Perform Statutory Audit, Consolidated Financial Statements\r  Involved in physical stock verification,\r  Experienced in performing variance analysis of P/L and Balance Sheet,\r  Involved in performing certification - Cash, Surprise Checks\r  Involved in testing of Internal Controls and perform JE Testing.","Sentiment":[Neutral]},{"Review":"It is good compony but i leave this compony as my family issue and compony provide the sallery time to time and this is call center concentrix india pvt","Sentiment":[Positive]},{"Review":"Nice Place to work.I have learnt many new technologies there.My team is very supportive in all the manner.","Sentiment":[Positive]},{"Review":"good company work for or aspired people might different organization better suited. wok life balance is depends on the role. Huge brand all over the world","Sentiment":[Positive]},{"Review":"No Additional benefits apart from salary. Organizational structure is very good. Strategies to drive the businesses are well versed.\r They provide all cutting-edge technologies and training programs to work on to improve yourself in the longer-term.","Sentiment":[Neutral]},{"Review":"Comfortable work place for beginners, however salary is less, work culture is really good","Sentiment":[Neutral]},{"Review":"If you work harder, company pay and reward you without any question. Good place for work and life balance. Flexible shift and good work environment.\r Sometime look on work output no other benefits. Management is supportive if you are a good performer.","Sentiment":[Positive]},{"Review":"All of my co-workers & officers are nice persons. Its very difficult to visit a sealed site by govt. for fault rectification.","Sentiment":[Neutral]},{"Review":"no proper compensation\r \r no profit sharing \r \r they treat their glass walls and grass floors better than employees\r \r manager rules over employees instead of managing","Sentiment":[Negative]},{"Review":"It was a long hours shifts there and I learned to solve customer queries and technical issues with their devices. My typing speed improved there as it was chat process. The management of the company is huge. The employees are the priority for them and they manage shifts of every team wisely. The hardest part was the long hours. As working in a team, I made lots of friends and learned so much from them. I relocated to Australia for further studies so I had to leave the job.","Sentiment":[Positive]},{"Review":"Good company but pressure is so much.    Salary is not good but works hours is much then 8 hours so it's difficult for me............................... Hi, thank you for your review. In HGS, aim to create an enjoyable environment for our employees. We take your feedback. Best wishes for your successful career ahead.","Sentiment":[Negative]},{"Review":"I had started my career at HSBC. It had helped me in growing professionally as well as technically. I was fun working at Hsbc and there is a good work life balance.","Sentiment":[Positive]},{"Review":". diffcult night shift, less salary, its a insrance company based on ammerica, lots of worker are there in hgs , we will get claim from client and we have to check clearly is it correctly billed or not if that claim is correctly billed then we have to make a payment other wise we will reject the claim.","Sentiment":[Negative]},{"Review":"If a say about work culture so it is so good ... Everyone has a friendly nature... And managment structure is too good .. And if i say about business so my productive is 100% of every month..","Sentiment":[Positive]},{"Review":"IBM is a pool for learning and developing our career . There would be a lot of fun activities every time which will ease the stress of the mind.Very kind and supportive management","Sentiment":[Positive]},{"Review":"If you understand the process then there will be no difficulty in your job. Very chill atmosphere, comfortable shifts available, No pressure at all and good perks.","Sentiment":[Positive]},{"Review":"Great bank with branches all over the work..helps improving your communication skills...if you want growth in your career you must join this bank..it will help you develop your self confidence..","Sentiment":[Positive]},{"Review":"Good place to work, very good polices and very friendly management . I personally feel its one of the best BPO's in the country","Sentiment":[Positive]},{"Review":"Amazing Coworkers, good infrastructure, excellent opportunities to expand skill-set.\r \r My manager was always supportive but also gave me some challenging assignments.\r \r Overall, I'd recommend this to anyone who has an understanding of Android/Java development, SDLC, Data Analysis and Agile.","Sentiment":[Positive]},{"Review":"We were working in Microsoft Process looking at issues faced by Windows users on their machines","Sentiment":[Neutral]},{"Review":"Goods review in company and good work this companies telant work and saf job yor company and your company management is best and your company     work is most intaligent with person","Sentiment":[Positive]},{"Review":"Working in Amazon is almost like jumping in a sea of knowledge. It is a cool and fun place to work. Amazon very religiously follows its tag line: Work hard, have fun, make history. The work environment is really good which inspires the employees.","Sentiment":[Positive]},{"Review":"Its good working here but i always aim to go to a product based company where i will be able to show my skills . TCS has good atmosphere and everything but i need more to broaden my skills","Sentiment":[Positive]},{"Review":"Employee can work from home when it is necessary. You will get more opportunities to learn.flexible timings and moderate work load ,more scope to learn new technologies","Sentiment":[Positive]},{"Review":"Good Compliance and process\r Rigid style of operation. \r Customer requirements are not addressed timely\r DGM and above positions are not approachable\r Poor budget for maintaining hygiene in buildings","Sentiment":[Negative]},{"Review":"A productive association to grow professionally and to excel. Enables us to learn and grow in due course of time.\r \r helps us to indulge in social activities that boosts morale.","Sentiment":[Positive]},{"Review":"\t4 years of experience in Market Research, Marketing and Customer Relationship Management in CPG and Banking Domain. \r \tAn effective communicator with strong leadership and inter-personal skills\r \tHands on experience on charting and reporting the manufacturer and product performance month after month.\r \tProven track record for providing insights to client on product performance issues and improvement strategy\r \tRecognized as Subject Matter Expert of Nielsen Interface to Range Objects (NITRO) and Nielsen Answers – POS data in Infosys\r \tRecognized as a Subject Matter Expert of Panel Data within 6 months of joining TCS due to proven knowledge of concepts and expertise on tools usage\r \tProficient in managing day to process, metrics management and operations\r \tDeft in leading dedicated teams for running successful business operations & experience of developing procedures and service standards for business excellence\r \tAn effective leader with excellent communication, analytical, team building & relationship management skills.","Sentiment":[Positive]},{"Review":"Good place to work with good work culture. A typical day starts with meeting with colleagues and discussing about the work at hand and the project deliverables.","Sentiment":[Positive]}]